Import library
Import file csv

In [2]:
import pandas as pd
import numpy as np
data = pd.read_csv('video_game_rating.csv')
data

,Unnamed: 0,title,year,genre,rating,votes,directors,plot
0,0,The Last of Us: Part I,2022,"Action, Adventure, Drama",9.8,601,"Matthew Gallant, Bruce Straley",Experience the emotional storytelling and unfo...
1,1,Red Dead Redemption II,2018,"Action, Adventure, Crime",9.7,"36,441",Missing,Amidst the decline of the Wild West at the tur...
2,2,The Witcher 3: Wild Hunt - Blood and Wine,2016,"Action, Adventure, Drama",9.7,"7,610",Konrad Tomaszkiewicz,Geralt is in the southern province of Toussain...
3,3,The Witcher 3: Wild Hunt,2015,"Action, Adventure, Drama",9.7,"26,328",Konrad Tomaszkiewicz,A monster hunter for hire embarks on an epic j...
4,4,The Last of Us,2013,"Action, Adventure, Drama",9.7,"61,103","Neil Druckmann, Bruce Straley","In a hostile, post-pandemic world, Joel and El..."
...,...,...,...,...,...,...,...,...
12630,12633,Superman,1999,"Action, Adventure, Family",1.4,646,Missing,The first 3D Superman game. Your friends Lois ...
12631,12634,Action 52,1991,"Action, Family, Fantasy",1.3,135,"Raul Gomila, Vince Perri",Play the action at your fingertips with 52 gam...
12632,12635,Plumbers Don't Wear Ties,1994,"Comedy, Romance",1.3,338,Michael Anderson,"John, an unattached plumber, meets and falls i..."
12633,12636,Animal Soccer World,2005,"Animation, Sport",1.2,125,Roswitha Haas,Everybody is busy with the preparations for th...
12634,12637,CrazyBus,2004,"Adventure, Family",1.0,126,Tom Maneiro,You get to select your bus and drive it across...

In [ ]:
Menampilkan jumlah record, nama atribut beserta tipe datanya

In [3]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12635 entries, 0 to 12634
Data columns (total 8 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  12635 non-null  int64
 1   title       12635 non-null  object
 2   year        12635 non-null  object
 3   genre       12635 non-null  object
 4   rating      12635 non-null  float64
 5   votes       12635 non-null  object
 6   directors   12635 non-null  object
 7   plot        12635 non-null  object
dtypes: float64(1), int64(1), object(6)
memory usage: 789.8+ KB

Menghitung jumlah record dataset

In [99]:
jumlah_record =pd.read_csv('video_game_rating.csv')
print (len(jumlah_record))

12635

Menghitung jumlah atribut dataset

In [34]:
jumlah_atribut = len(data.columns)
jumlah_atribut

8

Menampilkan nama atribut

In [133]:
data = pd.read_csv('video_game_rating.csv')
nama_atribut =(len(data.columns.values))
nama_atribut

8

Menampilkan jumlah atribut dengan tipe object

In [90]:
objek = data.select_dtypes(include = ['object'])
tipe_objek = len(objek.columns)
tipe_objek

6

Menampilkan jumlah atribut dengan tipe angka

In [127]:
angka = data.select_dtypes(include = ['int64'])
angka2 = data.select_dtypes(include = ['float64'])
tipe_angka1 = len(angka.columns)
tipe_angka2 = len(angka2.columns)
hasil_angka = tipe_angka1 + tipe_angka2
hasil_angka

2

Menampilkan jumlah atribut yang memiliki nilai NULL

In [83]:
nvll_tipe = data.isnull().any().sum()
nvll_tipe

0

Memasukkan informasi ke dalam dictionary

In [134]:
Dict = {
    "Jumlah Record"     : [jumlah_record],
    "Jumlah Atribut"    : [jumlah_atribut],
    "Nama Atribut"      : [nama_atribut],
    "Kolom Tipe Objek"  : [tipe_objek],
    "Kolom Tipe Angka"  : [hasil_angka],
    "Kolom dengan NULL" : [nvll_tipe]
    }
print(Dict)

{'Jumlah Record': [       Unnamed: 0                                      title  year  \
0               0                     The Last of Us: Part I  2022
1               1                     Red Dead Redemption II  2018
2               2  The Witcher 3: Wild Hunt - Blood and Wine  2016
3               3                   The Witcher 3: Wild Hunt  2015
4               4                             The Last of Us  2013
...           ...                                        ...   ...
12630       12633                                   Superman  1999
12631       12634                                  Action 52  1991
12632       12635                   Plumbers Don't Wear Ties  1994
12633       12636                        Animal Soccer World  2005
12634       12637                                   CrazyBus  2004

                           genre  rating   votes  \
0       Action, Adventure, Drama     9.8     601
1       Action, Adventure, Crime     9.7  36,441
2       Action, Adventure, Drama     9.7   7,610
3       Action, Adventure, Drama     9.7  26,328
4       Action, Adventure, Drama     9.7  61,103
...                          ...     ...     ...
12630  Action, Adventure, Family     1.4     646
12631    Action, Family, Fantasy     1.3     135
12632            Comedy, Romance     1.3     338
12633           Animation, Sport     1.2     125
12634          Adventure, Family     1.0     126

                            directors  \
0      Matthew Gallant, Bruce Straley
1                             Missing
2                Konrad Tomaszkiewicz
3                Konrad Tomaszkiewicz
4       Neil Druckmann, Bruce Straley
...                               ...
12630                         Missing
12631        Raul Gomila, Vince Perri
12632                Michael Anderson
12633                   Roswitha Haas
12634                     Tom Maneiro

                                                    plot
0      Experience the emotional storytelling and unfo...
1      Amidst the decline of the Wild West at the tur...
2      Geralt is in the southern province of Toussain...
3      A monster hunter for hire embarks on an epic j...
4      In a hostile, post-pandemic world, Joel and El...
...                                                  ...
12630  The first 3D Superman game. Your friends Lois ...
12631  Play the action at your fingertips with 52 gam...
12632  John, an unattached plumber, meets and falls i...
12633  Everybody is busy with the preparations for th...
12634  You get to select your bus and drive it across...

[12635 rows x 8 columns]], 'Jumlah Atribut': [8], 'Nama Atribut': [8], 'Kolom Tipe Objek': [6], 'Kolom Tipe Angka': [2], 'Kolom dengan NULL': [0]}

Menampilkan rata-rata, standar deviasi, nilai minimum, nilai maksimum, Q1, Q2, dan Q3 dari attribute bertipe angka.

In [121]:
data.describe()

         Unnamed: 0        rating
count  12635.000000  12635.000000
mean    6317.319747      6.945105
std     3648.018413      1.254719
min        0.000000      1.000000
25%     3158.500000      6.300000
50%     6317.000000      7.200000
75%     9475.500000      7.800000
max    12637.000000      9.800000

Menampilkan nilai korelasi

In [135]:
data.corr()

            Unnamed: 0    rating
Unnamed: 0    1.000000 -0.932981
rating       -0.932981  1.000000

Merubah atribut bertipe angka menjadi desimal

In [145]:
data['Unnamed: 0']*0.001

0         0.000
1         0.001
2         0.002
3         0.003
4         0.004
          ...
12630    12.633
12631    12.634
12632    12.635
12633    12.636
12634    12.637
Name: Unnamed: 0, Length: 12635, dtype: float64

Menampilkan 10 record pertama dari atribut bertipe angka

In [141]:
dataset_angka = data[['Unnamed: 0', 'rating']]
dataset_angka.head(10)

   Unnamed: 0  rating
0           0     9.8
1           1     9.7
2           2     9.7
3           3     9.7
4           4     9.7
5           5     9.7
6           6     9.6
7           7     9.6
8           8     9.6
9           9     9.6

Menyimpan dataset atribut bertipe angka ke file csv

In [142]:
dataset_angka.to_csv('videogamerating.csv')